Repository: GIP-RECIA/nextcloud-plugins
Catalog: org/apps/user_cas/l10n/*/user_cas.po
Languages: de

source: CAS Authentication backend
de: CAS Authentifizierungsbackend

source: Basic
de: Grundeinstellungen

source: Mapping
de: Zuordnungen

source: phpCAS Library
de: phpCAS Bibliothek

source: CAS Server Path
de: CAS Server Pfad

source: Service URL
de: Dienst URL

source: Certification file path (.crt).
de: Pfad zur Zertifikatsdatei (.crt).

source: Leave empty if you don’t want to validate your CAS server instance
de: Nicht ausfüllen, wenn Sie ihren CAS-Server nicht validieren möchten

source: Use CAS proxy initialization
de: CAS Proxy Initialisierung verwenden

source: Force user login using CAS?
de: CAS Login erzwingen?

source: Don’t use force login on these client-IPs
de: Login bei diesen Client-IPs nicht erzwingen

source: Comma separated list of client IP addresses (or address ranges), which won’t be forced to login if "Force user login" is enabled (e.g. 192.168.1.1-254,192.168.2.5)
de: Kommagetrennte Liste an Client-IP-Adressen (oder Adressräumen), die nicht zum Login gezwungen werden, wenn "CAS Login erzwingen" aktiviert ist (z.B: 192.168.1.1-254,192.168.2.5)

source: Disable CAS logout (do not logout CAS-session, only instance-session)
de: CAS Logout deaktivieren (nicht die CAS-Session, sondern nur die Instanz-Session ausloggen)

source: Disable CAS SingleSignout (do not logout instance-session if CAS-server sends SSO-Request)
de: CAS SingleSignout deaktivieren (nicht die Instanz-Session ausloggen, wenn der CAS-Server einen SSO-Request sendet)

source: SingleSignout Servers
de: Logout Server

source: Comma separated list of servers which can send SingleSignout requests (leave empty if you do not have to restrict SingleSignout to defined servers)
de: Kommagetrennte Liste an Servern, die SingleSingout-Requests an ihren CAS-Server senden dürfen (Nicht ausfüllen, wenn Sie SingleSignouts nicht beschränken/erlauben müssen)

source: Keep CAS-ticket-ids in URL?
de: CAS-Ticket-IDs nicht aus der URL entfernen

source: Beware: Potential security risk! Only activate, if you know what you are doing.
de: Achtung: Potentielles Sicherheitsrisiko! Nur aktivieren, wenn Sie wissen, was Sie tun.

source: Overwrite Login Button Label
de: Login Button Label überschreiben

source: Protect "public share" links with CAS
de: Teilen-Links mit CAS schützen

source: Autocreate user after first CAS login?
de: Benutzer nach erstem CAS Login automatisch erstellen?

source: Link CAS authentication with LDAP users and groups backend
de: CAS Authentifizierung mit LDAP Backend verknüpfen

source: Update user data after each CAS login?
de: Benutzerdaten nach jedem CAS Login aktualisieren?

source: Locked Groups
de: Geschützte Gruppen

source: Groups that will not be unlinked from the user when sync the CAS server and the owncloud
de: Gruppen, die beim Synchronisieren mit dem CAS Server nicht vom ownCloud Benutzer entfernt werden

source: Multivalued field, use comma to separate values
de: Mehrzeiliges Feld, nutzen Sie komma separierte Werte

source: Default Group
de: Standardgruppe

source: Default group when autocreating users and no group data was found for the user
de: Standardgruppe, die beim automatischen Neuerstellen von ownCloud Benutzern vergeben wird

source: Authorized CAS Groups
de: Authorisierte CAS Gruppen

source: Users in the following groups will be able to log into ownCloud, users not in one of the groups will be logged out immediately
de: Benutzer in den folgenden Gruppen können sich in ownCloud anmelden, Benutzer, die nicht in einer der Gruppen sind, werden sofort ausgeloggt

source: Group Quotas
de: Gruppenquotas

source: Use ECAS Attribute Parser?
de: ECAS Attribute Parser verwenden?

source: Request full user details?
de: Vollständige Benutzerdetails anfordern?

source: Not set
de: Nicht gesetzt

source: Query ECAS groups
de: Gruppen in ECAS-Abfrage

source: Note down all groups which you want to receive from your ECAS instance, * returns all groups
de: Setzen Sie alle Gruppen, die Sie von Ihrer ECAS-Instanz zurück erhalten möchten, * gibt alle Gruppen zurück

source: Don’t use Multi-Factor-Authentication on these client-IPs
de: Multi-Faktor-Authentifizierung bei diesen Client-IPs deaktivieren

source: Comma separated list of client IP addresses (or address ranges), which won’t be forced to use Multi-Factor-Authentication if "ECAS AssuranceLevel" is at least MEDIUM (e.g. 192.168.1.1-254,192.168.2.5)
de: Kommagetrennte Liste an Client-IP-Adressen (oder Adressräumen), die nicht zur Multi-Faktor-Authentifizierung gezwungen werden, wenn der "ECAS AssuranceLevel" mindestens MEDIUM ist (z.B: 192.168.1.1-254,192.168.2.5)

source: User-ID
de: Benutzername

source: Only map this attribute, if you want one specific CAS attribute as your user’s id. If left blank, the default CAS user-id is used.
de: Verwenden Sie das Attribut nur, wenn Sie ein spezifisches CAS-Attribut als Benutzername verwenden wollen. Lassen Sie das Attribut leer, um den Standard CAS Benutzernamen zu verwenden.

source: Display Name
de: Anzeigename

source: Groups
de: Gruppen

source: Group Name: JSON Decode
de: Gruppen Name: JSON-Decode aktivieren

source: Overwrite phpCAS path (CAS.php file)
de: phpCAS Pfad überschreiben (CAS.php Datei)

source: Optional: Overwrite phpCAS path (CAS.php file) if you want to use your own version. Leave blank to use the shipped version.
de: Optional: Überschreiben Sie den phpCAS Pfad (CAS.php Datei), wenn Sie eine eigene Version verwenden möchten. Nicht ausfüllen, wenn Sie die Standardversion verwenden möchten

source: PHP CAS debug file
de: PHP CAS debug Datei

source: Save
de: Speichern

source: Your CAS settings have been updated.
de: Ihre CAS Einstellungen wurden gespeichert.

source: Your CAS settings could not be updated. Please try again.
de: Ihre CAS Einstellungen konnten nicht gespeichert werden. Bitte versuchen Sie es erneut.

source: Forbidden. You do not have access to this application. Please refer to your administrator if something feels wrong to you.
de: Verboten. Sie haben keinen Zugriff auf diese Anwendung. Bitte wenden Sie sich an Ihren Administrator, wenn Sie denken, dass etwas nicht stimmt.

source: You do not have access to the JRCbox application. Please contact the JRCbox administrator if something feels wrong to you.
de: Sie haben keinen Zugriff auf diese JRCbox Anwendung. Bitte wenden Sie sich an den JRCbox Administrator, wenn Sie denken, dass etwas nicht stimmt.

source: Internal Server Error. The server encountered an error. Please try again.
de: Interner Serverfehler. Die Serveranfrage war fehlerhaft, bitte versuchen Sie es erneut.

source: Go back to the login page
de: Zurück zur Startseite

source: LDAP User and Domain
de: LDAP Benutzer und Domain

source: LDAP User Password
de: LDAP Benutzerpasswort

source: LDAP Base DN
de: LDAP Basis DN

source: LDAP Sync Pagesize (1–1500)
de: LDAP Sync Seitengröße (1–1500)

source: CLI Attribute Mapping
de: CLI Attributzuordnung

source: UID/Username
de: UID/Benutzername

source: Group Name Field
de: Gruppen Namensfeld

source: Group Name Filter
de: Gruppen Namensfeld Filter

source: Attention: You must use PHP (PCRE) Regex syntax for the filter.
de: Achtung: Sie müssen die PHP (PCRE) Regex Syntax für diesen Filter einhalten.

source: Group Name: Replace Umlauts
de: Gruppen Name: Ersetze Umlaute

source: Enable
de: Aktivierung

source: Calculate Enable Attribute Bitwise AND with
de: Berechne die Nutzer-Aktivierung 'Bitwise AND' mit

source: Merge Accounts
de: Accounts zusammenführen

source: Prefer Enabled over Disabled Accounts on Merge
de: Aktivierte Accounts beim Zusammenführen bevorzugen

source: Merge Two Active Accounts by
de: Zwei aktivierte Accounts zusammenfügen mit Hilfe vom Attribut

source: Merge Two Active Accounts by: Filterstring
de: Filterstring für das Zusammenfügen zweier aktivierter Accounts
