Repository: GIP-RECIA/nextcloud-plugins
Catalog: ldapimporter/l10n/*/ldap_importer.po
Languages: fr

source: CAS Authentication backend
fr: Authentification CAS

source: CAS Server
fr: Serveur CAS

source: phpCAS Library
fr: Librairie phpCAS

source: CAS Server Version
fr: Version du serveur CAS

source: CAS Server Hostname
fr: Nom d’hôte du serveur CAS

source: CAS Server Port
fr: Port du serveur CAS

source: CAS Server Path
fr: Chemin du serveur CAS

source: Service URL
fr: URL du service

source: Certification file path (.crt).
fr: Chemin du fichier de certification (.crt).

source: Leave empty if you don’t want to validate your CAS server instance
fr: Laissez vide si vous ne voulez pas valider votre instance de serveur CAS

source: Use CAS proxy initialization
fr: Utiliser l'initialisation du proxy CAS

source: Force user login using CAS?
fr: Forcer la connexion de l'utilisateur en utilisant CAS?

source: Don’t use force login on these client-IPs
fr: N'utilisez pas la connexion forcée sur ces adresses IP client

source: Comma separated list of client IP addresses (or address ranges), which won’t be forced to login if "Force user login" is enabled (e.g. 192.168.1.1-254,192.168.2.5)
fr: Liste des adresses IP (ou plages d'adresses) séparées par des virgules, qui ne sera pas obligée de se connecter si "Forcer la connexion utilisateur" est activé (par exemple 192.168.1.1-254, 192.168.2.5)

source: Disable CAS logout (do only OwnCloud logout)
fr: Désactiver la déconnexion CAS (déconnexion d'Owncloud uniquement)

source: Logout Servers
fr: Serveurs de déconnexion

source: Comma separated list of servers which can send logout requests (leave empty if you do not want to restrict logout to defined servers)
fr: Liste des serveurs séparés par des virgules pouvant envoyer des demandes de déconnexion (laissez vide si vous ne souhaitez pas limiter la déconnexion aux serveurs définis)

source: Autocreate user after first CAS login?
fr: Créer l'utilisateur automatiquement après la connexion CAS?

source: Link CAS authentication with LDAP users and groups backend
fr: Lier l'authentification CAS avec les utilisateurs et groupe de l'authentification LDAP?

source: Update user data after each CAS login?
fr: Mettre à jour les données utilisateurs après la connexion?

source: Locked Groups
fr: Groupes protégés

source: Groups that will not be unlinked from the user when sync the CAS server and the owncloud
fr: Groupes de l'utilisateur qui seront pas supprimés lors de la synchronisation entre le serveur CAS et Owncloud

source: Multivalued field, use comma to separate values
fr: Champ multivalué, utilisez des virgules pour séparer les valeurs

source: Default Group
fr: Groupe par défaut

source: Default group when autocreating users and no group data was found for the user
fr: Groupe par défaut lors de la création automatique des utilisateurs quand aucun groupe n'est trouvé pour l'utilisateur

source: Authorized CAS Groups
fr: Groupes autorisés CAS

source: Users in the following groups will be able to log into ownCloud, users not in one of the groups will be logged out immediately
fr: Les utilisateurs des groupes suivants pourront se connecter à ownCloud, les utilisateurs ne faisant pas partie d'un groupe seront déconnectés immédiatement

source: Group Quotas
fr: Quotas de groupe

source: Use ECAS Attribute Parser?
fr: Utiliser ECAS Attribute Parser?

source: Request full user details?
fr: Demander des informations complètes sur l'utilisateur?

source: Not set
fr: Pas encore défini

source: Query ECAS groups
fr: ECAS groupes de requêtes

source: Note down all groups which you want to receive from your ECAS instance, * returns all groups
fr: Notez tous les groupes que vous souhaitez recevoir de votre instance ECAS, * renvoie tous les groupes

source: Don’t use Multi-Factor-Authentication on these client-IPs
fr: N'utilisez pas l'authentification multi-facteurs sur ces IP client

source: Comma separated list of client IP addresses (or address ranges), which won’t be forced to use Multi-Factor-Authentication if "ECAS AssuranceLevel" is at least MEDIUM (e.g. 192.168.1.1-254,192.168.2.5)
fr: Liste d'adresses IP client (ou plages d'adresses), séparées par des virgules, qui ne seront pas obligées d'utiliser l'authentification à plusieurs facteurs si "ECAS AssuranceLevel" est au moins de MEDIUM (par exemple 192.168.1.1-254, 192.168.2.5)

source: Display Name
fr: Nom affiché

source: Groups
fr: Groupes

source: Overwrite phpCAS path (CAS.php file)
fr: Chemin PHP CAS (fichier CAS.php)

source: Optional: Overwrite phpCAS path (CAS.php file) if you want to use your own version. Leave blank to use the shipped version.
fr: Optionnel: Chemin PHP CAS (fichier CAS.php). Laissez vide pour utiliser la version expédiée.

source: PHP CAS debug file
fr: Chemin du fichier de debug de PHP CAS

source: Save
fr: Enregistrer

source: Your CAS settings have been updated.
fr: Vos paramètres CAS ont été mis à jour.

source: Your CAS settings could not be updated. Please try again.
fr: Vos paramètres CAS n'ont pas pu être mis à jour. Veuillez réessayer.

source: Forbidden. You do not have access to this application. Please refer to your administrator if something feels wrong to you.
fr: Interdit. Vous n'avez pas accès à cette application. Veuillez vous adresser à votre administrateur si quelque chose vous semble incorrect.

source: You do not have access to the JRCbox application. Please contact the JRCbox administrator if something feels wrong to you.
fr: Vous n'avez pas accès à cette application JRCbox. Veuillez vous adresser à votre administrateur JRCbox si quelque chose vous semble incorrect.

source: Internal Server Error. The server encountered an error. Please try again.
fr: Erreur Interne du Serveur. Le serveur a rencontré une erreur. Veuillez réessayer.

source: Go back to the login page
fr: Retourner à la page d'accueil

source: LDAP Host
fr: Hôte LDAP

source: LDAP User and Domain
fr: Utilisateur et domaine LDAP

source: LDAP User Password
fr: Mot de passe utilisateur LDAP

source: LDAP Sync Filter
fr: Filtre de synchronisation LDAP

source: CLI Attribute Mapping
fr: Mappage d'attributs CLI

source: UID/Username
fr: UID/Nom d'utilisateur

source: Group Name Field
fr: Nom du groupe

source: Group Pedagogic
fr: Nom des groupes pédagogique séparés par des virgules

source: Group Name Filter
fr: Filtre de nom de groupe

source: Attention: You must use PHP (PCRE) Regex syntax for the filter.
fr: Attention: Vous devez utiliser la syntaxe PHP (PCRE) Regex pour le filtre.

source: Group Name Replace Umlauts
fr: Nom du groupe - Remplacer les trémas

source: Enable
fr: Activer

source: Calculate Enable Attribute Bitwise AND with
fr: Calculer Activer Attribut Bitwise AND avec

source: Merge Accounts
fr: Fusionner des comptes

source: Prefer Enabled over Disabled Accounts on Merge
fr: Préférer activé sur les comptes désactivés lors de la fusion

source: Merge Two Active Accounts by
fr: Fusionner deux comptes actifs par

source: Merge Two Active Accounts by: Filterstring
fr: Fusionner deux comptes actifs par: Filtres
